%《MATLAB及其在理工课程中的应用指南》第六章例6－2－4程序的扩展（非正撞情况）
% 西安电子科技大学出版社出版  陈怀琛编著 1999年10月初版，2004年11月第二版
%% 
% 本程序不够完善，仅供参考
clear
K=100,logspace(-1,1,11);		% 把K设成自变量数组,
ur=zeros(9,2);vr=zeros(9,2);phi=zeros(9,2);
for i=1:9			% 对各个K循环计算
   theta=(i-1)*pi/8;
   ur1=roots([(1+1/K),-2/K*cos(theta),(1/K-1)]);	% 二次方程有两个解
   ur(i,:)=ur1';        %(abs(ur1-1)>0.001);		% 去掉在1邻近的庸解
   vr(i,:)=(1-ur(i,:)*cos(theta))./K;
   phi(i,:)=asin(ur(i,:)*sin(theta)/K./vr(i,:)); 
end							% 用（5）式求vr,用元素群运算
[[0:pi/8:pi]',ur,vr]									% 显示输出数据
e=1-ur.^2;
[[0:pi/8:pi]',phi,e]									% 显示输出数据
plot([0:pi/8:pi]',[ur,vr,e]),grid			%	绘图
set(gcf,'color','w')                        % 置图形背景色为白色


% h=6.626e-34;		普朗克常数[焦.秒]
% m0=9.11e-31;		电子质量[千克]
% c=3e8;				光速[米/秒]
% lx=1e-10;			x射线波长[米]
%?nux=c/lx=3.0000e+018				x射线频率[1/秒]
%?e=h*nux=  1.9878e-015			x射线能量[焦]
%?mx=e/c/c=  2.2087e-032			x光子质量
%?px=mx*c=e/c						x光子动量
%?m0/mx=   41.2466				电子与光子质量之比

