%《MATLAB及其在理工课程中的应用指南》第六章例6－4－2程序
% 线电荷的电场计算
% 西安电子科技大学出版社出版  陈怀琛编著 1999年10月初版，2004年11月第二版
%
clear all;
q = input('线电荷密度(库仑/m)= (书上取1) ');
L = input('线电荷半长度 (m)= (书上取或50) ');
N = input('线电荷分段数 N= (书上取50或500)  '); 
Nr = input('离原点距离分段数Nr= (书上取50) ');
E0 = 8.85e-12;           % 真空电介质常数ε0
C0 = 1/4/pi/E0	;			% 归并常数
L0 = linspace(-L,L,N+1);	% 将线电荷分N段
L1 = L0(1:N); L2=L0(2:N+1);	% 确定每个线段的起点和终点
Lm = (L1+L2)/2;dL= 2*L/N;	% 确定每个线段的中点坐标和长度,Lm是数组
R = linspace(0,10,Nr+1);	% 将R分N+1点
for k = 1:Nr+1				% 对R的N+1点循环计算
	Rk = sqrt(Lm.^2+R(k)^2);	% 测量点到电荷段的向径
	Vk = C0*dL*q./Rk;		% 第k个电荷段在测量点处产生的电位
	V(k) = sum(Vk);			% 对各电荷段在测量点处产生的电位求和
end
[max(V),min(V)]				% 显示最大最小电位
plot(R,V),grid				% 绘图
set(gcf,'color','w')        % 置图形背景色为白色
