%《MATLAB及其在理工课程中的应用指南》第七章例7－2－1程序
% 静不定杆系的受力计算
% 西安电子科技大学出版社出版  陈怀琛编著 1999年10月初版，2004年11月第二版
%
P=3000;E=200e9;L=2
A1=200e-6;A2=300e-6; A3=400e-6;
a1=pi/3; a2 = pi/2; a3=3*pi/4;
L1=L/sin(a1); L2=L/sin(a2); L3=L/sin(a3);	                % 计算杆长
K1=E*A1/L1; K2=E*A2/L2; K3=E*A3/L3;			                % 计算刚度系数
D = [cos(a1),cos(a2),cos(a3),0,0;sin(a1),sin(a2),sin(a3),0,0;...
      1/K1,0,0,-cos(a1),-sin(a1);0,1/K2,0,-cos(a2),-sin(a2);...
      0,0,1/K3,-cos(a3),-sin(a3)];                          % 列出静不定方程系数矩阵
B = [P;0;0;0;0];
format long, X = D\B                                        % 解矩阵方程
