%《MATLAB语言入门及应用指南》第八章例8－1－1程序
% 直流电路的稳态计算
% 西安电子科技大学出版社出版  陈怀琛编著 1999年10月初版，2004年11月第二版
%
r1=2;r2=4;r3=4;r4=4;r5=2;r6=12;r7=12;		        % 为给定元件赋值
a11=1/(r1+r2)+1/r3+1/r7;a12=-1/r3;a13=1/(r1+r2);	% 将系数矩阵各元素赋值
a21=1/r3;a22=-1/r3-1/(r4+r5)-1/r6; a23=0; 
us=input('us=');                                    % 输入解(1)的已知条件
A1=[a11,a12;a21,a22] 				                % 列出系数矩阵A1
u=A1\[a13*us;0]							            % u=[ub;uc]
ubc=u(1)-u(2),ude=u(2)*r5/(r4+r5),i=u(1)/r7         % 解(1)
ude=input('ude='),						            % 输入解(2)的已知条件
A2=[A1,-[a13;a23];0,r5/(r4+r5),0] 			        % 列出系数矩阵A2
u=A2\[0;0;ude],							            % u=[ub;uc;us]
ubc=u(1)-u(2),i=u(1)/r7,
us=(r1+r2)*(u(1)*a11+u(2)*a12) 	                    % 解(2)
