%《MATLAB及其在理工课程中的应用指南》第八章例8－1－8程序
% 网络参数的计算与变换
% 西安电子科技大学出版社出版  陈怀琛编著 1999年10月初版，2004年11月第二版
%
% 网络参数变换
r=100; L=0.02; C=0.01;w=300;
z1=r; z2 =j*w*L; z3=1/(j*w*C);
Z(1,1) =z1+z2; Z(1,2)=z2; Z(2,1)=z2; Z(2,2)=z2+z3;
Y=inv(Z), H=[det(Z), Z(1,2); -Z(2,1),1] / Z(2,2),
   
% 以下的公式不是为了直接执行,而是为读者复制和粘贴之用.   
%（1） Z=inv(Y); Y=inv(Z); B=inv(A); A=inv(B); H=inv(G); G=inv(H);
%这三组关系是可从它们的定义得到的。
%（2） A=[Z(1,1), det(Z); 1, Z(2,2)] / Z(2,1); 
%Z=[A(1,1), det(A); 1, A(2,2)] / A(2,1); 
%（3） H=[det(Z), Z(1,2); -Z(2,1),1] / Z(2,2); 
%Z=[ det(H), H(1,2); -H(2,1),1] / H(2,2);
%有了这三类关系，这六种参数中任何两者之间就都能变换了。例如已知Y阵，要求G阵，
%可用Z=inv(Y); G=inv([det(Z), Z(1,2); -Z(2,1),1] / Z(2,2)) 两个语句求得。
%2． 关于网络的实验和影像参数参数公式
%Zinf = A(1,1)/A(2,1);			% Zinf－负载阻抗为∞时的输入阻抗
%Zin0 = A(1,2)/A(2,2); 		% Zin0－负载阻抗为0时的输入阻抗
%Zoutf = A(2,2)/A(2,1);		% Zoutf－信号源阻抗为∞时的输出阻抗
%Zout0 = A(1,2)/A(1,1); 		% Zout0－信号源阻抗为0时的输出阻抗
%Zc = sqrt(Zinf*Zin0); Zc = sqrt(Zoutf*Zout0) 		% Zc－特性阻抗
%γ=α+jβ=20*log10((sqrt(Zinf)+sqrt(Zin0))/ (sqrt(Zoutf)-sqrt(Zout0)))
%γ－传输常数
