%《MATLAB及其在理工课程中的应用指南》第九章例9－3－4程序
% 由状态方程求传递函数
% 西安电子科技大学出版社出版  陈怀琛编著 1999年10月初版，2004年11月第二版
%
clear, 
disp('输入状态方程系数矩阵A,B,C,D')
disp('输入A=（书上取 [0.9501,0.8913,0.8214,0.9218;0.2311,0.7621,0.4447,0.7382;...')
disp('0.6068,0.4565,0.6154,0.1763;0.4860,0.0185,0.7919,0.4057] ')
A=input('A= ')
B=input('B= （书上取 [0.9355; 0.9169; 0.4103; 0.8936] )'), 
C=input('C= （书上取 [0.0579, 0.3529, 0.8132, 0.0099] ) '), 
D=input('D= （书上取 0 )')
g=poly(eig(A)); n=length(A);	        % 分母多项式系数g(i)由特征根求得
P(:,:,1)=eye(n);
f(1)=D*g(1);						    % 分子多项式系数f(i)由递推求得
f(2)=C*P(:,:,1 )*B+D*g(2);
for i=2:n 
   P(:,:,i )=A*P(:,:,i-1 )+g(i)*eye(n); 
   f(i+1)=C*P(:,:,i )*B+D*g(i+1); 
end
f, g
