%《线性代数实践及MATLAB入门》第二版第十章例题程序ag1005
% 材料力学的静不定问题
% 电子工业出版社出版  陈怀琛 龚杰民合著 2005年10月初版，2008年10月第二版
%
P=3000;E=200e9;L=2
A1=200e-6;A2=300e-6; A3=400e-6;
a1=pi/3; a2 = pi/2; a3=3*pi/4;
L1=L/sin(a1); L2=L/sin(a2); L3=L/sin(a3);	% 计算杆长
K1=E*A1/L1; K2=E*A2/L2; K3=E*A3/L3;			% 计算刚度系数
D(1,:) =[cos(a1),cos(a2),cos(a3),0,0];
D(2,:) =[sin(a1),sin(a2),sin(a3),0,0];
D(3,:) =[1/K1,0,0,-cos(a1),-sin(a1)];
D(4,:) =[0,1/K2,0,-cos(a2),-sin(a2)];
D(5,:) =[ 0,0,1/K3,-cos(a3),-sin(a3)];
B = [P;0;0;0;0];
format long, X = D\B 			%求解线性方程组，用长格式显示结果
